Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcumap_stm32f4x.h
/*
        Name: mcumap_stm32f40x.h
        Description: Contains all MCU and PIN definitions for STM32F10x to run
   µCNC.

        Copyright: Copyright (c) João Martins
        Author: João Martins
        Date: 05-02-2022

        µCNC is free software: you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation, either version 3 of the License, or
        (at your option) any later version. Please see
   <http://www.gnu.org/licenses/>

        µCNC is distributed WITHOUT ANY WARRANTY;
        Also without the implied warranty of	MERCHANTABILITY or FITNESS FOR A
   PARTICULAR PURPOSE. See the	GNU General Public License for more details.
*/

#ifndef MCUMAP_STM32F4x_H
#define MCUMAP_STM32F4x_H

#ifdef __cplusplus
extern "C" {
#endif

/*
        Generates all the interface definitions.
        This creates a middle HAL layer between the board IO pins and the AVR
   funtionalities
*/
/*
        MCU specific definitions and replacements
*/

#include <stdbool.h>
#include <stm32f4xx.h>
#include <stm32f4xx_hal_rcc.h>

// defines the frequency of the mcu
#ifndef F_CPU
#define F_CPU SystemCoreClock
#warning                                                                       \
    "F_CPU not defined as a constant. Cycle/Nanoseconds delays will be take longer then expected"
#endif

// defines the maximum and minimum step rates
#ifndef F_STEP_MAX
#define F_STEP_MAX 100000
#endif
#ifndef F_STEP_MIN
#define F_STEP_MIN 4
#endif
// defines special mcu to access flash strings and arrays
#define __rom__
#define __romstr__
#define __romarr__ const uint8_t
#define rom_strptr *
#define rom_strcpy strcpy
#define rom_strncpy strncpy
#define rom_memcpy memcpy
#define rom_read_byte *

// NVIC Priority levels
#define NVIC_INPUT_IRQ_Pri 1
#define NVIC_SPI_IRQ_Pri 3
#define NVIC_UART_IRQ_Pri 4
#define NVIC_ITP_IRQ_Pri 5
#define NVIC_ONESHOT_IRQ_Pri 6
#define NVIC_SERVO_IRQ_Pri 6
#define NVIC_RTC_IRQ_Pri 8
#define NVIC_I2C_IRQ_Pri 9
#define NVIC_USB_IRQ_Pri 10

// needed by software delays
#ifndef MCU_CYCLES_PER_LOOP
#define MCU_CYCLES_PER_LOOP 4
#endif
#ifndef MCU_CYCLES_LOOP_OVERHEAD
#define MCU_CYCLES_LOOP_OVERHEAD 1
#endif

#define mcu_delay_loop(X)                                                      \
  do {                                                                         \
    asm volatile("" ::: "memory");                                             \
    register uint16_t __count = (X);                                           \
    __asm__ volatile("1: sub %[cnt], %[cnt], #1\n" /* 1 cycle */               \
                     "   cmp %[cnt], #0\n"         /* 1 cycle */               \
                     "   bne 1b\n"                 /* 1–2 cycles */            \
                     "   nop\n"                    /* 1 cycle */               \
                     : [cnt] "+r"(__count)                                     \
                     :                                                         \
                     : "cc");                                                  \
    asm volatile("" ::: "memory");                                             \
  } while (0)

// Helper macros
#define __helper_ex__(left, mid, right) left##mid##right
#define __helper__(left, mid, right) __helper_ex__(left, mid, right)
#define __iopin_ex__(port, bit) STM32IO_##port##bit
#define __iopin__(port, bit) __iopin_ex__(port, bit)
#define STM32IO_A0 1
#define STM32IO_A1 2
#define STM32IO_A2 3
#define STM32IO_A3 4
#define STM32IO_A4 5
#define STM32IO_A5 6
#define STM32IO_A6 7
#define STM32IO_A7 8
#define STM32IO_A8 9
#define STM32IO_A9 10
#define STM32IO_A10 11
#define STM32IO_A11 12
#define STM32IO_A12 13
#define STM32IO_A13 14
#define STM32IO_A14 15
#define STM32IO_A15 16
#define STM32IO_B0 17
#define STM32IO_B1 18
#define STM32IO_B2 19
#define STM32IO_B3 20
#define STM32IO_B4 21
#define STM32IO_B5 22
#define STM32IO_B6 23
#define STM32IO_B7 24
#define STM32IO_B8 25
#define STM32IO_B9 26
#define STM32IO_B10 27
#define STM32IO_B11 28
#define STM32IO_B12 29
#define STM32IO_B13 30
#define STM32IO_B14 31
#define STM32IO_B15 32
#define STM32IO_C0 33
#define STM32IO_C1 34
#define STM32IO_C2 35
#define STM32IO_C3 36
#define STM32IO_C4 37
#define STM32IO_C5 38
#define STM32IO_C6 39
#define STM32IO_C7 40
#define STM32IO_C8 41
#define STM32IO_C9 42
#define STM32IO_C10 43
#define STM32IO_C11 44
#define STM32IO_C12 45
#define STM32IO_C13 46
#define STM32IO_C14 47
#define STM32IO_C15 48
#define STM32IO_D0 49
#define STM32IO_D1 50
#define STM32IO_D2 51
#define STM32IO_D3 52
#define STM32IO_D4 53
#define STM32IO_D5 54
#define STM32IO_D6 55
#define STM32IO_D7 56
#define STM32IO_D8 57
#define STM32IO_D9 58
#define STM32IO_D10 59
#define STM32IO_D11 60
#define STM32IO_D12 61
#define STM32IO_D13 62
#define STM32IO_D14 63
#define STM32IO_D15 64
#define STM32IO_E0 65
#define STM32IO_E1 66
#define STM32IO_E2 67
#define STM32IO_E3 68
#define STM32IO_E4 69
#define STM32IO_E5 70
#define STM32IO_E6 71
#define STM32IO_E7 72
#define STM32IO_E8 73
#define STM32IO_E9 74
#define STM32IO_E10 75
#define STM32IO_E11 76
#define STM32IO_E12 77
#define STM32IO_E13 78
#define STM32IO_E14 79
#define STM32IO_E15 80
#define STM32IO_F0 81
#define STM32IO_F1 82
#define STM32IO_F2 83
#define STM32IO_F3 84
#define STM32IO_F4 85
#define STM32IO_F5 86
#define STM32IO_F6 87
#define STM32IO_F7 88
#define STM32IO_F8 89
#define STM32IO_F9 90
#define STM32IO_F10 91
#define STM32IO_F11 92
#define STM32IO_F12 93
#define STM32IO_F13 94
#define STM32IO_F14 95
#define STM32IO_F15 96
#define STM32IO_G0 97
#define STM32IO_G1 98
#define STM32IO_G2 99
#define STM32IO_G3 100
#define STM32IO_G4 101
#define STM32IO_G5 102
#define STM32IO_G6 103
#define STM32IO_G7 104
#define STM32IO_G8 105
#define STM32IO_G9 106
#define STM32IO_G10 107
#define STM32IO_G11 108
#define STM32IO_G12 109
#define STM32IO_G13 110
#define STM32IO_G14 111
#define STM32IO_G15 112
#define STM32IO_H0 113
#define STM32IO_H1 114
#define STM32IO_H2 115
#define STM32IO_H3 116
#define STM32IO_H4 117
#define STM32IO_H5 118
#define STM32IO_H6 119
#define STM32IO_H7 120
#define STM32IO_H8 121
#define STM32IO_H9 122
#define STM32IO_H10 123
#define STM32IO_H11 124
#define STM32IO_H12 125
#define STM32IO_H13 126
#define STM32IO_H14 127
#define STM32IO_H15 128

// STM32 internal register names
#define __gpio__(X) (__helper__(GPIO, X, ))
#define __rccgpioen__(X) (__helper__(RCC_AHB1ENR_GPIO, X, EN))
#define __afioexti__(X) __helper__(EXTI, X, )
#define __extirq__(X) __helper__(EXTI, X, _IRQn)
#define __tim__(X) (__helper__(TIM, X, ))
#define __irq__(X) (__helper__(X, _IRQn, ))
#define __rccapb1timen__(X) (__helper__(RCC_APB1ENR_TIM, X, EN))
#define __rccapb2timen__(X) (__helper__(RCC_APB2ENR_TIM, X, EN))
#define __ccr__(X) __helper__(CCR, X, )
#define __usart__(X) __helper__(USART, X, )
#define __uart__(X) __helper__(UART, X, )

/**********************************************
 *	Autogenerated macros
 **********************************************/

