Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcumap_stm32f4x.h
#define DIN27_GPIO (__gpio__(DIN27_PORT))
#define DIO157 157
#define DIO157_PORT DIN27_PORT
#define DIO157_BIT DIN27_BIT
#define DIO157_AHB1EN DIN27_AHB1EN
#define DIO157_GPIO DIN27_GPIO
#endif
#if (defined(DIN28_PORT) && defined(DIN28_BIT))
#define DIN28 158
#define DIN28_AHB1EN (__rccgpioen__(DIN28_PORT))
#define DIN28_GPIO (__gpio__(DIN28_PORT))
#define DIO158 158
#define DIO158_PORT DIN28_PORT
#define DIO158_BIT DIN28_BIT
#define DIO158_AHB1EN DIN28_AHB1EN
#define DIO158_GPIO DIN28_GPIO
#endif
#if (defined(DIN29_PORT) && defined(DIN29_BIT))
#define DIN29 159
#define DIN29_AHB1EN (__rccgpioen__(DIN29_PORT))
#define DIN29_GPIO (__gpio__(DIN29_PORT))
#define DIO159 159
#define DIO159_PORT DIN29_PORT
#define DIO159_BIT DIN29_BIT
#define DIO159_AHB1EN DIN29_AHB1EN
#define DIO159_GPIO DIN29_GPIO
#endif
#if (defined(DIN30_PORT) && defined(DIN30_BIT))
#define DIN30 160
#define DIN30_AHB1EN (__rccgpioen__(DIN30_PORT))
#define DIN30_GPIO (__gpio__(DIN30_PORT))
#define DIO160 160
#define DIO160_PORT DIN30_PORT
#define DIO160_BIT DIN30_BIT
#define DIO160_AHB1EN DIN30_AHB1EN
#define DIO160_GPIO DIN30_GPIO
#endif
#if (defined(DIN31_PORT) && defined(DIN31_BIT))
#define DIN31 161
#define DIN31_AHB1EN (__rccgpioen__(DIN31_PORT))
#define DIN31_GPIO (__gpio__(DIN31_PORT))
#define DIO161 161
#define DIO161_PORT DIN31_PORT
#define DIO161_BIT DIN31_BIT
#define DIO161_AHB1EN DIN31_AHB1EN
#define DIO161_GPIO DIN31_GPIO
#endif
#if (defined(DIN32_PORT) && defined(DIN32_BIT))
#define DIN32 162
#define DIN32_AHB1EN (__rccgpioen__(DIN32_PORT))
#define DIN32_GPIO (__gpio__(DIN32_PORT))
#define DIO162 162
#define DIO162_PORT DIN32_PORT
#define DIO162_BIT DIN32_BIT
#define DIO162_AHB1EN DIN32_AHB1EN
#define DIO162_GPIO DIN32_GPIO
#endif
#if (defined(DIN33_PORT) && defined(DIN33_BIT))
#define DIN33 163
#define DIN33_AHB1EN (__rccgpioen__(DIN33_PORT))
#define DIN33_GPIO (__gpio__(DIN33_PORT))
#define DIO163 163
#define DIO163_PORT DIN33_PORT
#define DIO163_BIT DIN33_BIT
#define DIO163_AHB1EN DIN33_AHB1EN
#define DIO163_GPIO DIN33_GPIO
#endif
#if (defined(DIN34_PORT) && defined(DIN34_BIT))
#define DIN34 164
#define DIN34_AHB1EN (__rccgpioen__(DIN34_PORT))
#define DIN34_GPIO (__gpio__(DIN34_PORT))
#define DIO164 164
#define DIO164_PORT DIN34_PORT
#define DIO164_BIT DIN34_BIT
#define DIO164_AHB1EN DIN34_AHB1EN
#define DIO164_GPIO DIN34_GPIO
#endif
#if (defined(DIN35_PORT) && defined(DIN35_BIT))
#define DIN35 165
#define DIN35_AHB1EN (__rccgpioen__(DIN35_PORT))
#define DIN35_GPIO (__gpio__(DIN35_PORT))
#define DIO165 165
#define DIO165_PORT DIN35_PORT
#define DIO165_BIT DIN35_BIT
#define DIO165_AHB1EN DIN35_AHB1EN
#define DIO165_GPIO DIN35_GPIO
#endif
#if (defined(DIN36_PORT) && defined(DIN36_BIT))
#define DIN36 166
#define DIN36_AHB1EN (__rccgpioen__(DIN36_PORT))
#define DIN36_GPIO (__gpio__(DIN36_PORT))
#define DIO166 166
#define DIO166_PORT DIN36_PORT
#define DIO166_BIT DIN36_BIT
#define DIO166_AHB1EN DIN36_AHB1EN
#define DIO166_GPIO DIN36_GPIO
#endif
#if (defined(DIN37_PORT) && defined(DIN37_BIT))
#define DIN37 167
#define DIN37_AHB1EN (__rccgpioen__(DIN37_PORT))
#define DIN37_GPIO (__gpio__(DIN37_PORT))
#define DIO167 167
#define DIO167_PORT DIN37_PORT
#define DIO167_BIT DIN37_BIT
#define DIO167_AHB1EN DIN37_AHB1EN
#define DIO167_GPIO DIN37_GPIO
#endif
#if (defined(DIN38_PORT) && defined(DIN38_BIT))
#define DIN38 168
#define DIN38_AHB1EN (__rccgpioen__(DIN38_PORT))
#define DIN38_GPIO (__gpio__(DIN38_PORT))
#define DIO168 168
#define DIO168_PORT DIN38_PORT
#define DIO168_BIT DIN38_BIT
#define DIO168_AHB1EN DIN38_AHB1EN
#define DIO168_GPIO DIN38_GPIO
#endif
#if (defined(DIN39_PORT) && defined(DIN39_BIT))
#define DIN39 169
#define DIN39_AHB1EN (__rccgpioen__(DIN39_PORT))
#define DIN39_GPIO (__gpio__(DIN39_PORT))
#define DIO169 169
#define DIO169_PORT DIN39_PORT
#define DIO169_BIT DIN39_BIT
#define DIO169_AHB1EN DIN39_AHB1EN
#define DIO169_GPIO DIN39_GPIO
#endif
#if (defined(DIN40_PORT) && defined(DIN40_BIT))
#define DIN40 170
#define DIN40_AHB1EN (__rccgpioen__(DIN40_PORT))
#define DIN40_GPIO (__gpio__(DIN40_PORT))
#define DIO170 170
#define DIO170_PORT DIN40_PORT
#define DIO170_BIT DIN40_BIT
#define DIO170_AHB1EN DIN40_AHB1EN
#define DIO170_GPIO DIN40_GPIO
#endif
#if (defined(DIN41_PORT) && defined(DIN41_BIT))
#define DIN41 171
#define DIN41_AHB1EN (__rccgpioen__(DIN41_PORT))
#define DIN41_GPIO (__gpio__(DIN41_PORT))
#define DIO171 171
#define DIO171_PORT DIN41_PORT
#define DIO171_BIT DIN41_BIT
#define DIO171_AHB1EN DIN41_AHB1EN
#define DIO171_GPIO DIN41_GPIO
#endif
#if (defined(DIN42_PORT) && defined(DIN42_BIT))
#define DIN42 172
#define DIN42_AHB1EN (__rccgpioen__(DIN42_PORT))
#define DIN42_GPIO (__gpio__(DIN42_PORT))
#define DIO172 172
#define DIO172_PORT DIN42_PORT
#define DIO172_BIT DIN42_BIT
#define DIO172_AHB1EN DIN42_AHB1EN
#define DIO172_GPIO DIN42_GPIO
#endif
#if (defined(DIN43_PORT) && defined(DIN43_BIT))
#define DIN43 173
#define DIN43_AHB1EN (__rccgpioen__(DIN43_PORT))
#define DIN43_GPIO (__gpio__(DIN43_PORT))
#define DIO173 173
#define DIO173_PORT DIN43_PORT
#define DIO173_BIT DIN43_BIT
#define DIO173_AHB1EN DIN43_AHB1EN
#define DIO173_GPIO DIN43_GPIO
#endif
#if (defined(DIN44_PORT) && defined(DIN44_BIT))
#define DIN44 174
#define DIN44_AHB1EN (__rccgpioen__(DIN44_PORT))
#define DIN44_GPIO (__gpio__(DIN44_PORT))
#define DIO174 174
#define DIO174_PORT DIN44_PORT
#define DIO174_BIT DIN44_BIT
#define DIO174_AHB1EN DIN44_AHB1EN
#define DIO174_GPIO DIN44_GPIO
#endif
#if (defined(DIN45_PORT) && defined(DIN45_BIT))
#define DIN45 175
#define DIN45_AHB1EN (__rccgpioen__(DIN45_PORT))
#define DIN45_GPIO (__gpio__(DIN45_PORT))
#define DIO175 175
#define DIO175_PORT DIN45_PORT
#define DIO175_BIT DIN45_BIT
#define DIO175_AHB1EN DIN45_AHB1EN
#define DIO175_GPIO DIN45_GPIO
#endif
#if (defined(DIN46_PORT) && defined(DIN46_BIT))
#define DIN46 176
#define DIN46_AHB1EN (__rccgpioen__(DIN46_PORT))
#define DIN46_GPIO (__gpio__(DIN46_PORT))
#define DIO176 176
#define DIO176_PORT DIN46_PORT
#define DIO176_BIT DIN46_BIT
#define DIO176_AHB1EN DIN46_AHB1EN
#define DIO176_GPIO DIN46_GPIO
#endif
#if (defined(DIN47_PORT) && defined(DIN47_BIT))
#define DIN47 177
#define DIN47_AHB1EN (__rccgpioen__(DIN47_PORT))
#define DIN47_GPIO (__gpio__(DIN47_PORT))
#define DIO177 177
#define DIO177_PORT DIN47_PORT
#define DIO177_BIT DIN47_BIT
#define DIO177_AHB1EN DIN47_AHB1EN
#define DIO177_GPIO DIN47_GPIO
#endif
#if (defined(DIN48_PORT) && defined(DIN48_BIT))
#define DIN48 178
#define DIN48_AHB1EN (__rccgpioen__(DIN48_PORT))
#define DIN48_GPIO (__gpio__(DIN48_PORT))
#define DIO178 178
#define DIO178_PORT DIN48_PORT
#define DIO178_BIT DIN48_BIT
#define DIO178_AHB1EN DIN48_AHB1EN
#define DIO178_GPIO DIN48_GPIO
#endif
#if (defined(DIN49_PORT) && defined(DIN49_BIT))
#define DIN49 179
#define DIN49_AHB1EN (__rccgpioen__(DIN49_PORT))
#define DIN49_GPIO (__gpio__(DIN49_PORT))
#define DIO179 179
#define DIO179_PORT DIN49_PORT
#define DIO179_BIT DIN49_BIT
#define DIO179_AHB1EN DIN49_AHB1EN
#define DIO179_GPIO DIN49_GPIO
#endif
#if (defined(TX_PORT) && defined(TX_BIT))
#define TX 200
#define TX_AHB1EN (__rccgpioen__(TX_PORT))
#define TX_GPIO (__gpio__(TX_PORT))
#define DIO200 200
#define DIO200_PORT TX_PORT
#define DIO200_BIT TX_BIT
#define DIO200_AHB1EN TX_AHB1EN
#define DIO200_GPIO TX_GPIO
#endif
#if (defined(RX_PORT) && defined(RX_BIT))
#define RX 201
#define RX_AHB1EN (__rccgpioen__(RX_PORT))
#define RX_GPIO (__gpio__(RX_PORT))
#define DIO201 201
#define DIO201_PORT RX_PORT
#define DIO201_BIT RX_BIT
#define DIO201_AHB1EN RX_AHB1EN
#define DIO201_GPIO RX_GPIO
#endif
#if (defined(USB_DM_PORT) && defined(USB_DM_BIT))
#define USB_DM 202
#define USB_DM_AHB1EN (__rccgpioen__(USB_DM_PORT))
#define USB_DM_GPIO (__gpio__(USB_DM_PORT))
#define DIO202 202
#define DIO202_PORT USB_DM_PORT
#define DIO202_BIT USB_DM_BIT
#define DIO202_AHB1EN USB_DM_AHB1EN
#define DIO202_GPIO USB_DM_GPIO
#endif
#if (defined(USB_DP_PORT) && defined(USB_DP_BIT))
#define USB_DP 203
#define USB_DP_AHB1EN (__rccgpioen__(USB_DP_PORT))
#define USB_DP_GPIO (__gpio__(USB_DP_PORT))
#define DIO203 203
#define DIO203_PORT USB_DP_PORT
#define DIO203_BIT USB_DP_BIT
#define DIO203_AHB1EN USB_DP_AHB1EN
#define DIO203_GPIO USB_DP_GPIO
#endif
#if (defined(SPI_CLK_PORT) && defined(SPI_CLK_BIT))
#define SPI_CLK 204
#define SPI_CLK_AHB1EN (__rccgpioen__(SPI_CLK_PORT))
#define SPI_CLK_GPIO (__gpio__(SPI_CLK_PORT))
#define DIO204 204
#define DIO204_PORT SPI_CLK_PORT
#define DIO204_BIT SPI_CLK_BIT
#define DIO204_AHB1EN SPI_CLK_AHB1EN
#define DIO204_GPIO SPI_CLK_GPIO
#endif
#if (defined(SPI_SDI_PORT) && defined(SPI_SDI_BIT))
#define SPI_SDI 205
#define SPI_SDI_AHB1EN (__rccgpioen__(SPI_SDI_PORT))
#define SPI_SDI_GPIO (__gpio__(SPI_SDI_PORT))
#define DIO205 205
#define DIO205_PORT SPI_SDI_PORT
#define DIO205_BIT SPI_SDI_BIT
#define DIO205_AHB1EN SPI_SDI_AHB1EN
#define DIO205_GPIO SPI_SDI_GPIO
#endif
#if (defined(SPI_SDO_PORT) && defined(SPI_SDO_BIT))
#define SPI_SDO 206
#define SPI_SDO_AHB1EN (__rccgpioen__(SPI_SDO_PORT))
#define SPI_SDO_GPIO (__gpio__(SPI_SDO_PORT))
#define DIO206 206
#define DIO206_PORT SPI_SDO_PORT
#define DIO206_BIT SPI_SDO_BIT
#define DIO206_AHB1EN SPI_SDO_AHB1EN
#define DIO206_GPIO SPI_SDO_GPIO
#endif
#if (defined(SPI_CS_PORT) && defined(SPI_CS_BIT))
#define SPI_CS 207
#define SPI_CS_AHB1EN (__rccgpioen__(SPI_CS_PORT))
#define SPI_CS_GPIO (__gpio__(SPI_CS_PORT))
#define DIO207 207
#define DIO207_PORT SPI_CS_PORT
#define DIO207_BIT SPI_CS_BIT
#define DIO207_AHB1EN SPI_CS_AHB1EN
#define DIO207_GPIO SPI_CS_GPIO
#endif
#if (defined(I2C_CLK_PORT) && defined(I2C_CLK_BIT))
#define I2C_CLK 208
#define I2C_CLK_AHB1EN (__rccgpioen__(I2C_CLK_PORT))
#define I2C_CLK_GPIO (__gpio__(I2C_CLK_PORT))
#define DIO208 208
#define DIO208_PORT I2C_CLK_PORT
#define DIO208_BIT I2C_CLK_BIT
#define DIO208_AHB1EN I2C_CLK_AHB1EN
#define DIO208_GPIO I2C_CLK_GPIO
#endif
#if (defined(I2C_DATA_PORT) && defined(I2C_DATA_BIT))
#define I2C_DATA 209
#define I2C_DATA_AHB1EN (__rccgpioen__(I2C_DATA_PORT))
#define I2C_DATA_GPIO (__gpio__(I2C_DATA_PORT))
#define DIO209 209
#define DIO209_PORT I2C_DATA_PORT
#define DIO209_BIT I2C_DATA_BIT
#define DIO209_AHB1EN I2C_DATA_AHB1EN
#define DIO209_GPIO I2C_DATA_GPIO
#endif
#if (defined(TX2_PORT) && defined(TX2_BIT))
#define TX2 210
#define TX2_AHB1EN (__rccgpioen__(TX2_PORT))
#define TX2_GPIO (__gpio__(TX2_PORT))
#define DIO210 210
#define DIO210_PORT TX2_PORT
#define DIO210_BIT TX2_BIT
#define DIO210_AHB1EN TX2_AHB1EN
#define DIO210_GPIO TX2_GPIO
#endif
#if (defined(RX2_PORT) && defined(RX2_BIT))
#define RX2 211
#define RX2_AHB1EN (__rccgpioen__(RX2_PORT))
#define RX2_GPIO (__gpio__(RX2_PORT))
#define DIO211 211
#define DIO211_PORT RX2_PORT
#define DIO211_BIT RX2_BIT
#define DIO211_AHB1EN RX2_AHB1EN
#define DIO211_GPIO RX2_GPIO
#endif
#if (defined(SPI2_CLK_PORT) && defined(SPI2_CLK_BIT))
#define SPI2_CLK 212
#define SPI2_CLK_AHB1EN (__rccgpioen__(SPI2_CLK_PORT))
#define SPI2_CLK_GPIO (__gpio__(SPI2_CLK_PORT))
#define DIO212 212
#define DIO212_PORT SPI2_CLK_PORT
#define DIO212_BIT SPI2_CLK_BIT
#define DIO212_AHB1EN SPI2_CLK_AHB1EN
#define DIO212_GPIO SPI2_CLK_GPIO
#endif
#if (defined(SPI2_SDI_PORT) && defined(SPI2_SDI_BIT))
#define SPI2_SDI 213
#define SPI2_SDI_AHB1EN (__rccgpioen__(SPI2_SDI_PORT))
#define SPI2_SDI_GPIO (__gpio__(SPI2_SDI_PORT))
#define DIO213 213
#define DIO213_PORT SPI2_SDI_PORT
#define DIO213_BIT SPI2_SDI_BIT
#define DIO213_AHB1EN SPI2_SDI_AHB1EN
#define DIO213_GPIO SPI2_SDI_GPIO
#endif
#if (defined(SPI2_SDO_PORT) && defined(SPI2_SDO_BIT))
#define SPI2_SDO 214
#define SPI2_SDO_AHB1EN (__rccgpioen__(SPI2_SDO_PORT))
#define SPI2_SDO_GPIO (__gpio__(SPI2_SDO_PORT))
#define DIO214 214
#define DIO214_PORT SPI2_SDO_PORT
#define DIO214_BIT SPI2_SDO_BIT
#define DIO214_AHB1EN SPI2_SDO_AHB1EN
#define DIO214_GPIO SPI2_SDO_GPIO
#endif
#if (defined(SPI2_CS_PORT) && defined(SPI2_CS_BIT))
#define SPI2_CS 215
#define SPI2_CS_AHB1EN (__rccgpioen__(SPI2_CS_PORT))
#define SPI2_CS_GPIO (__gpio__(SPI2_CS_PORT))
#define DIO215 215
#define DIO215_PORT SPI2_CS_PORT
#define DIO215_BIT SPI2_CS_BIT
#define DIO215_AHB1EN SPI2_CS_AHB1EN
#define DIO215_GPIO SPI2_CS_GPIO
#endif

#if (defined(TX) && defined(RX))
#define MCU_HAS_UART
#endif
#if (defined(TX2) && defined(RX2))
#define MCU_HAS_UART2
#endif
#if (defined(USB_DP) && defined(USB_DM))
#define GPIO_OTG_FS 0x0A
#define MCU_HAS_USB
extern uint32_t tud_cdc_n_write_available(uint8_t itf);
extern uint32_t tud_cdc_n_available(uint8_t itf);
extern bool tud_cdc_n_connected(uint8_t itf);
#define usb_tx_available()                                                     \
  (tud_cdc_n_write_available(0) || !tud_cdc_n_connected(0))
#define usb_rx_available() tud_cdc_n_available(0)
#endif

/**********************************************
 *	ISR on change inputs
 **********************************************/
#define EXTINT_A 0
#define EXTINT_B 1
#define EXTINT_C 2
#define EXTINT_D 3
#define EXTINT_E 4
#if (defined(STM32F401xB) || defined(STM32F401xC) || defined(STM32F401xE))
#define EXTINT_H 5
#else
#define EXTINT_F 5
#define EXTINT_G 6
#define EXTINT_H 7
#define EXTINT_I 8
#define EXTINT_J 9
#define EXTINT_K 10
#endif
#define _EXTINT(X) EXTINT_##X
#define EXTINT(X) _EXTINT(X)

#define EXTIRQ_0 EXTI0_IRQn
#define EXTIRQ_1 EXTI1_IRQn
#define EXTIRQ_2 EXTI2_IRQn
#define EXTIRQ_3 EXTI3_IRQn
#define EXTIRQ_4 EXTI4_IRQn
#define EXTIRQ_5 EXTI9_5_IRQn
#define EXTIRQ_6 EXTI9_5_IRQn
#define EXTIRQ_7 EXTI9_5_IRQn
#define EXTIRQ_8 EXTI9_5_IRQn
#define EXTIRQ_9 EXTI9_5_IRQn
#define EXTIRQ_10 EXTI15_10_IRQn
#define EXTIRQ_11 EXTI15_10_IRQn
#define EXTIRQ_12 EXTI15_10_IRQn
#define EXTIRQ_13 EXTI15_10_IRQn
#define EXTIRQ_14 EXTI15_10_IRQn
#define EXTIRQ_15 EXTI15_10_IRQn
#define _EXTIRQ(X) EXTIRQ_##X
#define EXTIRQ(X) _EXTIRQ(X)

