Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcumap_stm32f4x.h
/**********************************************
 *	PWM pins
 **********************************************/
#if (defined(PWM0_CHANNEL) && defined(PWM0_TIMER) && defined(PWM0))
#if (PWM0_TIMER == 1 || (PWM0_TIMER >= 8 & PWM0_TIMER <= 11))
#define PWM0_ENREG RCC->APB2ENR
#define PWM0_APBEN __helper__(RCC_APB2ENR_TIM, PWM0_TIMER, EN)
#define PWM0_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM0_ENREG RCC->APB1ENR
#define PWM0_APBEN __helper__(RCC_APB1ENR_TIM, PWM0_TIMER, EN)
#define PWM0_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM0_TIMREG (__tim__(PWM0_TIMER))
#ifndef PWM0_FREQ
#define PWM0_FREQ 1000
#endif
#if (PWM0_CHANNEL & 0x01)
#define PWM0_MODE 0x0064
#else
#define PWM0_MODE 0x6400
#endif
#if (PWM0_CHANNEL > 2)
#define PWM0_CCMREG CCMR2
#else
#define PWM0_CCMREG CCMR1
#endif
#if (PWM0_TIMER == 1)
#define PWM0_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM0_TIMER == 8)
#define PWM0_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM0_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM0_TIMER >= 1) && (PWM0_TIMER <= 2)
#define PWM0_AF 0x01
#elif (PWM0_TIMER >= 3) && (PWM0_TIMER <= 5)
#define PWM0_AF 0x02
#else
#define PWM0_AF 0x03
#endif
#define PWM0_CCR __ccr__(PWM0_CHANNEL)
#define DIO25_TIMER PWM0_TIMER
#define DIO25_CHANNEL PWM0_CHANNEL
#define DIO25_ENREG PWM0_ENREG
#define DIO25_APBEN PWM0_APBEN
#define DIO25_TIMREG PWM0_TIMREG
#define DIO25_APBEN PWM0_APBEN
#define DIO25_FREQ PWM0_FREQ
#define DIO25_MODE PWM0_MODE
#define DIO25_CCMREG PWM0_CCMREG
#define DIO25_CCR PWM0_CCR
#define DIO25_ENOUTPUT PWM0_ENOUTPUT
#define DIO25_AF PWM0_AF
#define DIO25_CLOCK PWM0_CLOCK
#endif
#if (defined(PWM1_CHANNEL) && defined(PWM1_TIMER) && defined(PWM1))
#if (PWM1_TIMER == 1 || (PWM1_TIMER >= 8 & PWM1_TIMER <= 11))
#define PWM1_ENREG RCC->APB2ENR
#define PWM1_APBEN __helper__(RCC_APB2ENR_TIM, PWM1_TIMER, EN)
#define PWM1_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM1_ENREG RCC->APB1ENR
#define PWM1_APBEN __helper__(RCC_APB1ENR_TIM, PWM1_TIMER, EN)
#define PWM1_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM1_TIMREG (__tim__(PWM1_TIMER))
#ifndef PWM1_FREQ
#define PWM1_FREQ 1000
#endif
#if (PWM1_CHANNEL & 0x01)
#define PWM1_MODE 0x0064
#else
#define PWM1_MODE 0x6400
#endif
#if (PWM1_CHANNEL > 2)
#define PWM1_CCMREG CCMR2
#else
#define PWM1_CCMREG CCMR1
#endif
#if (PWM1_TIMER == 1)
#define PWM1_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM1_TIMER == 8)
#define PWM1_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM1_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM1_TIMER >= 1) && (PWM1_TIMER <= 2)
#define PWM1_AF 0x01
#elif (PWM1_TIMER >= 3) && (PWM1_TIMER <= 5)
#define PWM1_AF 0x02
#else
#define PWM1_AF 0x03
#endif
#define PWM1_CCR __ccr__(PWM1_CHANNEL)
#define DIO26_TIMER PWM1_TIMER
#define DIO26_CHANNEL PWM1_CHANNEL
#define DIO26_ENREG PWM1_ENREG
#define DIO26_APBEN PWM1_APBEN
#define DIO26_TIMREG PWM1_TIMREG
#define DIO26_APBEN PWM1_APBEN
#define DIO26_FREQ PWM1_FREQ
#define DIO26_MODE PWM1_MODE
#define DIO26_CCMREG PWM1_CCMREG
#define DIO26_CCR PWM1_CCR
#define DIO26_ENOUTPUT PWM1_ENOUTPUT
#define DIO26_AF PWM1_AF
#define DIO26_CLOCK PWM1_CLOCK
#endif
#if (defined(PWM2_CHANNEL) && defined(PWM2_TIMER) && defined(PWM2))
#if (PWM2_TIMER == 1 || (PWM2_TIMER >= 8 & PWM2_TIMER <= 11))
#define PWM2_ENREG RCC->APB2ENR
#define PWM2_APBEN __helper__(RCC_APB2ENR_TIM, PWM2_TIMER, EN)
#define PWM2_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM2_ENREG RCC->APB1ENR
#define PWM2_APBEN __helper__(RCC_APB1ENR_TIM, PWM2_TIMER, EN)
#define PWM2_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM2_TIMREG (__tim__(PWM2_TIMER))
#ifndef PWM2_FREQ
#define PWM2_FREQ 1000
#endif
#if (PWM2_CHANNEL & 0x01)
#define PWM2_MODE 0x0064
#else
#define PWM2_MODE 0x6400
#endif
#if (PWM2_CHANNEL > 2)
#define PWM2_CCMREG CCMR2
#else
#define PWM2_CCMREG CCMR1
#endif
#if (PWM2_TIMER == 1)
#define PWM2_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM2_TIMER == 8)
#define PWM2_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM2_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM2_TIMER >= 1) && (PWM2_TIMER <= 2)
#define PWM2_AF 0x01
#elif (PWM2_TIMER >= 3) && (PWM2_TIMER <= 5)
#define PWM2_AF 0x02
#else
#define PWM2_AF 0x03
#endif
#define PWM2_CCR __ccr__(PWM2_CHANNEL)
#define DIO27_TIMER PWM2_TIMER
#define DIO27_CHANNEL PWM2_CHANNEL
#define DIO27_ENREG PWM2_ENREG
#define DIO27_APBEN PWM2_APBEN
#define DIO27_TIMREG PWM2_TIMREG
#define DIO27_APBEN PWM2_APBEN
#define DIO27_FREQ PWM2_FREQ
#define DIO27_MODE PWM2_MODE
#define DIO27_CCMREG PWM2_CCMREG
#define DIO27_CCR PWM2_CCR
#define DIO27_ENOUTPUT PWM2_ENOUTPUT
#define DIO27_AF PWM2_AF
#define DIO27_CLOCK PWM2_CLOCK
#endif
#if (defined(PWM3_CHANNEL) && defined(PWM3_TIMER) && defined(PWM3))
#if (PWM3_TIMER == 1 || (PWM3_TIMER >= 8 & PWM3_TIMER <= 11))
#define PWM3_ENREG RCC->APB2ENR
#define PWM3_APBEN __helper__(RCC_APB2ENR_TIM, PWM3_TIMER, EN)
#define PWM3_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM3_ENREG RCC->APB1ENR
#define PWM3_APBEN __helper__(RCC_APB1ENR_TIM, PWM3_TIMER, EN)
#define PWM3_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM3_TIMREG (__tim__(PWM3_TIMER))
#ifndef PWM3_FREQ
#define PWM3_FREQ 1000
#endif
#if (PWM3_CHANNEL & 0x01)
#define PWM3_MODE 0x0064
#else
#define PWM3_MODE 0x6400
#endif
#if (PWM3_CHANNEL > 2)
#define PWM3_CCMREG CCMR2
#else
#define PWM3_CCMREG CCMR1
#endif
#if (PWM3_TIMER == 1)
#define PWM3_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM3_TIMER == 8)
#define PWM3_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM3_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM3_TIMER >= 1) && (PWM3_TIMER <= 2)
#define PWM3_AF 0x01
#elif (PWM3_TIMER >= 3) && (PWM3_TIMER <= 5)
#define PWM3_AF 0x02
#else
#define PWM3_AF 0x03
#endif
#define PWM3_CCR __ccr__(PWM3_CHANNEL)
#define DIO28_TIMER PWM3_TIMER
#define DIO28_CHANNEL PWM3_CHANNEL
#define DIO28_ENREG PWM3_ENREG
#define DIO28_APBEN PWM3_APBEN
#define DIO28_TIMREG PWM3_TIMREG
#define DIO28_APBEN PWM3_APBEN
#define DIO28_FREQ PWM3_FREQ
#define DIO28_MODE PWM3_MODE
#define DIO28_CCMREG PWM3_CCMREG
#define DIO28_CCR PWM3_CCR
#define DIO28_ENOUTPUT PWM3_ENOUTPUT
#define DIO28_AF PWM3_AF
#define DIO28_CLOCK PWM3_CLOCK
#endif
#if (defined(PWM4_CHANNEL) && defined(PWM4_TIMER) && defined(PWM4))
#if (PWM4_TIMER == 1 || (PWM4_TIMER >= 8 & PWM4_TIMER <= 11))
#define PWM4_ENREG RCC->APB2ENR
#define PWM4_APBEN __helper__(RCC_APB2ENR_TIM, PWM4_TIMER, EN)
#define PWM4_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM4_ENREG RCC->APB1ENR
#define PWM4_APBEN __helper__(RCC_APB1ENR_TIM, PWM4_TIMER, EN)
#define PWM4_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM4_TIMREG (__tim__(PWM4_TIMER))
#ifndef PWM4_FREQ
#define PWM4_FREQ 1000
#endif
#if (PWM4_CHANNEL & 0x01)
#define PWM4_MODE 0x0064
#else
#define PWM4_MODE 0x6400
#endif
#if (PWM4_CHANNEL > 2)
#define PWM4_CCMREG CCMR2
#else
#define PWM4_CCMREG CCMR1
#endif
#if (PWM4_TIMER == 1)
#define PWM4_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM4_TIMER == 8)
#define PWM4_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM4_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM4_TIMER >= 1) && (PWM4_TIMER <= 2)
#define PWM4_AF 0x01
#elif (PWM4_TIMER >= 3) && (PWM4_TIMER <= 5)
#define PWM4_AF 0x02
#else
#define PWM4_AF 0x03
#endif
#define PWM4_CCR __ccr__(PWM4_CHANNEL)
#define DIO29_TIMER PWM4_TIMER
#define DIO29_CHANNEL PWM4_CHANNEL
#define DIO29_ENREG PWM4_ENREG
#define DIO29_APBEN PWM4_APBEN
#define DIO29_TIMREG PWM4_TIMREG
#define DIO29_APBEN PWM4_APBEN
#define DIO29_FREQ PWM4_FREQ
#define DIO29_MODE PWM4_MODE
#define DIO29_CCMREG PWM4_CCMREG
#define DIO29_CCR PWM4_CCR
#define DIO29_ENOUTPUT PWM4_ENOUTPUT
#define DIO29_AF PWM4_AF
#define DIO29_CLOCK PWM4_CLOCK
#endif
#if (defined(PWM5_CHANNEL) && defined(PWM5_TIMER) && defined(PWM5))
#if (PWM5_TIMER == 1 || (PWM5_TIMER >= 8 & PWM5_TIMER <= 11))
#define PWM5_ENREG RCC->APB2ENR
#define PWM5_APBEN __helper__(RCC_APB2ENR_TIM, PWM5_TIMER, EN)
#define PWM5_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM5_ENREG RCC->APB1ENR
#define PWM5_APBEN __helper__(RCC_APB1ENR_TIM, PWM5_TIMER, EN)
#define PWM5_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM5_TIMREG (__tim__(PWM5_TIMER))
#ifndef PWM5_FREQ
#define PWM5_FREQ 1000
#endif
#if (PWM5_CHANNEL & 0x01)
#define PWM5_MODE 0x0064
#else
#define PWM5_MODE 0x6400
#endif
#if (PWM5_CHANNEL > 2)
#define PWM5_CCMREG CCMR2
#else
#define PWM5_CCMREG CCMR1
#endif
#if (PWM5_TIMER == 1)
#define PWM5_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM5_TIMER == 8)
#define PWM5_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM5_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM5_TIMER >= 1) && (PWM5_TIMER <= 2)
#define PWM5_AF 0x01
#elif (PWM5_TIMER >= 3) && (PWM5_TIMER <= 5)
#define PWM5_AF 0x02
#else
#define PWM5_AF 0x03
#endif
#define PWM5_CCR __ccr__(PWM5_CHANNEL)
#define DIO30_TIMER PWM5_TIMER
#define DIO30_CHANNEL PWM5_CHANNEL
#define DIO30_ENREG PWM5_ENREG
#define DIO30_APBEN PWM5_APBEN
#define DIO30_TIMREG PWM5_TIMREG
#define DIO30_APBEN PWM5_APBEN
#define DIO30_FREQ PWM5_FREQ
#define DIO30_MODE PWM5_MODE
#define DIO30_CCMREG PWM5_CCMREG
#define DIO30_CCR PWM5_CCR
#define DIO30_ENOUTPUT PWM5_ENOUTPUT
#define DIO30_AF PWM5_AF
#define DIO30_CLOCK PWM5_CLOCK
#endif
#if (defined(PWM6_CHANNEL) && defined(PWM6_TIMER) && defined(PWM6))
#if (PWM6_TIMER == 1 || (PWM6_TIMER >= 8 & PWM6_TIMER <= 11))
#define PWM6_ENREG RCC->APB2ENR
#define PWM6_APBEN __helper__(RCC_APB2ENR_TIM, PWM6_TIMER, EN)
#define PWM6_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM6_ENREG RCC->APB1ENR
#define PWM6_APBEN __helper__(RCC_APB1ENR_TIM, PWM6_TIMER, EN)
#define PWM6_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM6_TIMREG (__tim__(PWM6_TIMER))
#ifndef PWM6_FREQ
#define PWM6_FREQ 1000
#endif
#if (PWM6_CHANNEL & 0x01)
#define PWM6_MODE 0x0064
#else
#define PWM6_MODE 0x6400
#endif
#if (PWM6_CHANNEL > 2)
#define PWM6_CCMREG CCMR2
#else
#define PWM6_CCMREG CCMR1
#endif
#if (PWM6_TIMER == 1)
#define PWM6_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM6_TIMER == 8)
#define PWM6_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM6_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM6_TIMER >= 1) && (PWM6_TIMER <= 2)
#define PWM6_AF 0x01
#elif (PWM6_TIMER >= 3) && (PWM6_TIMER <= 5)
#define PWM6_AF 0x02
#else
#define PWM6_AF 0x03
#endif
#define PWM6_CCR __ccr__(PWM6_CHANNEL)
#define DIO31_TIMER PWM6_TIMER
#define DIO31_CHANNEL PWM6_CHANNEL
#define DIO31_ENREG PWM6_ENREG
#define DIO31_APBEN PWM6_APBEN
#define DIO31_TIMREG PWM6_TIMREG
#define DIO31_APBEN PWM6_APBEN
#define DIO31_FREQ PWM6_FREQ
#define DIO31_MODE PWM6_MODE
#define DIO31_CCMREG PWM6_CCMREG
#define DIO31_CCR PWM6_CCR
#define DIO31_ENOUTPUT PWM6_ENOUTPUT
#define DIO31_AF PWM6_AF
#define DIO31_CLOCK PWM6_CLOCK
#endif
#if (defined(PWM7_CHANNEL) && defined(PWM7_TIMER) && defined(PWM7))
#if (PWM7_TIMER == 1 || (PWM7_TIMER >= 8 & PWM7_TIMER <= 11))
#define PWM7_ENREG RCC->APB2ENR
#define PWM7_APBEN __helper__(RCC_APB2ENR_TIM, PWM7_TIMER, EN)
#define PWM7_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM7_ENREG RCC->APB1ENR
#define PWM7_APBEN __helper__(RCC_APB1ENR_TIM, PWM7_TIMER, EN)
#define PWM7_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM7_TIMREG (__tim__(PWM7_TIMER))
#ifndef PWM7_FREQ
#define PWM7_FREQ 1000
#endif
#if (PWM7_CHANNEL & 0x01)
#define PWM7_MODE 0x0064
#else
#define PWM7_MODE 0x6400
#endif
#if (PWM7_CHANNEL > 2)
#define PWM7_CCMREG CCMR2
#else
#define PWM7_CCMREG CCMR1
#endif
#if (PWM7_TIMER == 1)
#define PWM7_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM7_TIMER == 8)
#define PWM7_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM7_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM7_TIMER >= 1) && (PWM7_TIMER <= 2)
#define PWM7_AF 0x01
#elif (PWM7_TIMER >= 3) && (PWM7_TIMER <= 5)
#define PWM7_AF 0x02
#else
#define PWM7_AF 0x03
#endif
#define PWM7_CCR __ccr__(PWM7_CHANNEL)
#define DIO32_TIMER PWM7_TIMER
#define DIO32_CHANNEL PWM7_CHANNEL
#define DIO32_ENREG PWM7_ENREG
#define DIO32_APBEN PWM7_APBEN
#define DIO32_TIMREG PWM7_TIMREG
#define DIO32_APBEN PWM7_APBEN
#define DIO32_FREQ PWM7_FREQ
#define DIO32_MODE PWM7_MODE
#define DIO32_CCMREG PWM7_CCMREG
#define DIO32_CCR PWM7_CCR
#define DIO32_ENOUTPUT PWM7_ENOUTPUT
#define DIO32_AF PWM7_AF
#define DIO32_CLOCK PWM7_CLOCK
#endif
#if (defined(PWM8_CHANNEL) && defined(PWM8_TIMER) && defined(PWM8))
#if (PWM8_TIMER == 1 || (PWM8_TIMER >= 8 & PWM8_TIMER <= 11))
#define PWM8_ENREG RCC->APB2ENR
#define PWM8_APBEN __helper__(RCC_APB2ENR_TIM, PWM8_TIMER, EN)
#define PWM8_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM8_ENREG RCC->APB1ENR
#define PWM8_APBEN __helper__(RCC_APB1ENR_TIM, PWM8_TIMER, EN)
#define PWM8_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM8_TIMREG (__tim__(PWM8_TIMER))
#ifndef PWM8_FREQ
#define PWM8_FREQ 1000
#endif
#if (PWM8_CHANNEL & 0x01)
#define PWM8_MODE 0x0064
#else
#define PWM8_MODE 0x6400
#endif
#if (PWM8_CHANNEL > 2)
#define PWM8_CCMREG CCMR2
#else
#define PWM8_CCMREG CCMR1
#endif
#if (PWM8_TIMER == 1)
#define PWM8_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM8_TIMER == 8)
#define PWM8_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM8_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM8_TIMER >= 1) && (PWM8_TIMER <= 2)
#define PWM8_AF 0x01
#elif (PWM8_TIMER >= 3) && (PWM8_TIMER <= 5)
#define PWM8_AF 0x02
#else
#define PWM8_AF 0x03
#endif
#define PWM8_CCR __ccr__(PWM8_CHANNEL)
#define DIO33_TIMER PWM8_TIMER
#define DIO33_CHANNEL PWM8_CHANNEL
#define DIO33_ENREG PWM8_ENREG
#define DIO33_APBEN PWM8_APBEN
#define DIO33_TIMREG PWM8_TIMREG
#define DIO33_APBEN PWM8_APBEN
#define DIO33_FREQ PWM8_FREQ
#define DIO33_MODE PWM8_MODE
#define DIO33_CCMREG PWM8_CCMREG
#define DIO33_CCR PWM8_CCR
#define DIO33_ENOUTPUT PWM8_ENOUTPUT
#define DIO33_AF PWM8_AF
#define DIO33_CLOCK PWM8_CLOCK
#endif
#if (defined(PWM9_CHANNEL) && defined(PWM9_TIMER) && defined(PWM9))
#if (PWM9_TIMER == 1 || (PWM9_TIMER >= 8 & PWM9_TIMER <= 11))
#define PWM9_ENREG RCC->APB2ENR
#define PWM9_APBEN __helper__(RCC_APB2ENR_TIM, PWM9_TIMER, EN)
#define PWM9_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM9_ENREG RCC->APB1ENR
#define PWM9_APBEN __helper__(RCC_APB1ENR_TIM, PWM9_TIMER, EN)
#define PWM9_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM9_TIMREG (__tim__(PWM9_TIMER))
#ifndef PWM9_FREQ
#define PWM9_FREQ 1000
#endif
#if (PWM9_CHANNEL & 0x01)
#define PWM9_MODE 0x0064
#else
#define PWM9_MODE 0x6400
#endif
#if (PWM9_CHANNEL > 2)
#define PWM9_CCMREG CCMR2
#else
#define PWM9_CCMREG CCMR1
#endif
#if (PWM9_TIMER == 1)
#define PWM9_ENOUTPUT                                                          \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM9_TIMER == 8)
#define PWM9_ENOUTPUT                                                          \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM9_ENOUTPUT                                                          \
  {                                                                            \
  }
#endif
#if (PWM9_TIMER >= 1) && (PWM9_TIMER <= 2)
#define PWM9_AF 0x01
#elif (PWM9_TIMER >= 3) && (PWM9_TIMER <= 5)
#define PWM9_AF 0x02
#else
#define PWM9_AF 0x03
#endif
#define PWM9_CCR __ccr__(PWM9_CHANNEL)
#define DIO34_TIMER PWM9_TIMER
#define DIO34_CHANNEL PWM9_CHANNEL
#define DIO34_ENREG PWM9_ENREG
#define DIO34_APBEN PWM9_APBEN
#define DIO34_TIMREG PWM9_TIMREG
#define DIO34_APBEN PWM9_APBEN
#define DIO34_FREQ PWM9_FREQ
#define DIO34_MODE PWM9_MODE
#define DIO34_CCMREG PWM9_CCMREG
#define DIO34_CCR PWM9_CCR
#define DIO34_ENOUTPUT PWM9_ENOUTPUT
#define DIO34_AF PWM9_AF
#define DIO34_CLOCK PWM9_CLOCK
#endif
#if (defined(PWM10_CHANNEL) && defined(PWM10_TIMER) && defined(PWM10))
#if (PWM10_TIMER == 1 || (PWM10_TIMER >= 8 & PWM10_TIMER <= 11))
#define PWM10_ENREG RCC->APB2ENR
#define PWM10_APBEN __helper__(RCC_APB2ENR_TIM, PWM10_TIMER, EN)
#define PWM10_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM10_ENREG RCC->APB1ENR
#define PWM10_APBEN __helper__(RCC_APB1ENR_TIM, PWM10_TIMER, EN)
#define PWM10_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM10_TIMREG (__tim__(PWM10_TIMER))
#ifndef PWM10_FREQ
#define PWM10_FREQ 1000
#endif
#if (PWM10_CHANNEL & 0x01)
#define PWM10_MODE 0x0064
#else
#define PWM10_MODE 0x6400
#endif
#if (PWM10_CHANNEL > 2)
#define PWM10_CCMREG CCMR2
#else
#define PWM10_CCMREG CCMR1
#endif
#if (PWM10_TIMER == 1)
#define PWM10_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM10_TIMER == 8)
#define PWM10_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM10_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM10_TIMER >= 1) && (PWM10_TIMER <= 2)
#define PWM10_AF 0x01
#elif (PWM10_TIMER >= 3) && (PWM10_TIMER <= 5)
#define PWM10_AF 0x02
#else
#define PWM10_AF 0x03
#endif
#define PWM10_CCR __ccr__(PWM10_CHANNEL)
#define DIO35_TIMER PWM10_TIMER
#define DIO35_CHANNEL PWM10_CHANNEL
#define DIO35_ENREG PWM10_ENREG
#define DIO35_APBEN PWM10_APBEN
#define DIO35_TIMREG PWM10_TIMREG
#define DIO35_APBEN PWM10_APBEN
#define DIO35_FREQ PWM10_FREQ
#define DIO35_MODE PWM10_MODE
#define DIO35_CCMREG PWM10_CCMREG
#define DIO35_CCR PWM10_CCR
#define DIO35_ENOUTPUT PWM10_ENOUTPUT
#define DIO35_AF PWM10_AF
#define DIO35_CLOCK PWM10_CLOCK
#endif
#if (defined(PWM11_CHANNEL) && defined(PWM11_TIMER) && defined(PWM11))
#if (PWM11_TIMER == 1 || (PWM11_TIMER >= 8 & PWM11_TIMER <= 11))
#define PWM11_ENREG RCC->APB2ENR
#define PWM11_APBEN __helper__(RCC_APB2ENR_TIM, PWM11_TIMER, EN)
#define PWM11_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM11_ENREG RCC->APB1ENR
#define PWM11_APBEN __helper__(RCC_APB1ENR_TIM, PWM11_TIMER, EN)
#define PWM11_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM11_TIMREG (__tim__(PWM11_TIMER))
#ifndef PWM11_FREQ
#define PWM11_FREQ 1000
#endif
#if (PWM11_CHANNEL & 0x01)
#define PWM11_MODE 0x0064
#else
#define PWM11_MODE 0x6400
#endif
#if (PWM11_CHANNEL > 2)
#define PWM11_CCMREG CCMR2
#else
#define PWM11_CCMREG CCMR1
#endif
#if (PWM11_TIMER == 1)
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM11_TIMER == 8)
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM11_TIMER >= 1) && (PWM11_TIMER <= 2)
#define PWM11_AF 0x01
#elif (PWM11_TIMER >= 3) && (PWM11_TIMER <= 5)
#define PWM11_AF 0x02
#else
#define PWM11_AF 0x03
#endif
#define PWM11_CCR __ccr__(PWM11_CHANNEL)
