Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcumap_stm32f4x.h
#define DIO36_TIMER PWM11_TIMER
#define DIO36_CHANNEL PWM11_CHANNEL
#define DIO36_ENREG PWM11_ENREG
#define DIO36_APBEN PWM11_APBEN
#define DIO36_TIMREG PWM11_TIMREG
#define DIO36_APBEN PWM11_APBEN
#define DIO36_FREQ PWM11_FREQ
#define DIO36_MODE PWM11_MODE
#define DIO36_CCMREG PWM11_CCMREG
#define DIO36_CCR PWM11_CCR
#define DIO36_ENOUTPUT PWM11_ENOUTPUT
#define DIO36_AF PWM11_AF
#define DIO36_CLOCK PWM11_CLOCK
#endif
#if (defined(PWM12_CHANNEL) && defined(PWM12_TIMER) && defined(PWM12))
#if (PWM12_TIMER == 1 || (PWM12_TIMER >= 8 & PWM12_TIMER <= 11))
#define PWM12_ENREG RCC->APB2ENR
#define PWM12_APBEN __helper__(RCC_APB2ENR_TIM, PWM12_TIMER, EN)
#define PWM12_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM12_ENREG RCC->APB1ENR
#define PWM12_APBEN __helper__(RCC_APB1ENR_TIM, PWM12_TIMER, EN)
#define PWM12_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM12_TIMREG (__tim__(PWM12_TIMER))
#ifndef PWM12_FREQ
#define PWM12_FREQ 1000
#endif
#if (PWM12_CHANNEL & 0x01)
#define PWM12_MODE 0x0064
#else
#define PWM12_MODE 0x6400
#endif
#if (PWM12_CHANNEL > 2)
#define PWM12_CCMREG CCMR2
#else
#define PWM12_CCMREG CCMR1
#endif
#if (PWM12_TIMER == 1)
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM12_TIMER == 8)
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM12_TIMER >= 1) && (PWM12_TIMER <= 2)
#define PWM12_AF 0x01
#elif (PWM12_TIMER >= 3) && (PWM12_TIMER <= 5)
#define PWM12_AF 0x02
#else
#define PWM12_AF 0x03
#endif
#define PWM12_CCR __ccr__(PWM12_CHANNEL)
#define DIO37_TIMER PWM12_TIMER
#define DIO37_CHANNEL PWM12_CHANNEL
#define DIO37_ENREG PWM12_ENREG
#define DIO37_APBEN PWM12_APBEN
#define DIO37_TIMREG PWM12_TIMREG
#define DIO37_APBEN PWM12_APBEN
#define DIO37_FREQ PWM12_FREQ
#define DIO37_MODE PWM12_MODE
#define DIO37_CCMREG PWM12_CCMREG
#define DIO37_CCR PWM12_CCR
#define DIO37_ENOUTPUT PWM12_ENOUTPUT
#define DIO37_AF PWM12_AF
#define DIO37_CLOCK PWM12_CLOCK
#endif
#if (defined(PWM13_CHANNEL) && defined(PWM13_TIMER) && defined(PWM13))
#if (PWM13_TIMER == 1 || (PWM13_TIMER >= 8 & PWM13_TIMER <= 11))
#define PWM13_ENREG RCC->APB2ENR
#define PWM13_APBEN __helper__(RCC_APB2ENR_TIM, PWM13_TIMER, EN)
#define PWM13_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM13_ENREG RCC->APB1ENR
#define PWM13_APBEN __helper__(RCC_APB1ENR_TIM, PWM13_TIMER, EN)
#define PWM13_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM13_TIMREG (__tim__(PWM13_TIMER))
#ifndef PWM13_FREQ
#define PWM13_FREQ 1000
#endif
#if (PWM13_CHANNEL & 0x01)
#define PWM13_MODE 0x0064
#else
#define PWM13_MODE 0x6400
#endif
#if (PWM13_CHANNEL > 2)
#define PWM13_CCMREG CCMR2
#else
#define PWM13_CCMREG CCMR1
#endif
#if (PWM13_TIMER == 1)
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM13_TIMER == 8)
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM13_TIMER >= 1) && (PWM13_TIMER <= 2)
#define PWM13_AF 0x01
#elif (PWM13_TIMER >= 3) && (PWM13_TIMER <= 5)
#define PWM13_AF 0x02
#else
#define PWM13_AF 0x03
#endif
#define PWM13_CCR __ccr__(PWM13_CHANNEL)
#define DIO38_TIMER PWM13_TIMER
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_ENREG PWM13_ENREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_TIMREG PWM13_TIMREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_FREQ PWM13_FREQ
#define DIO38_MODE PWM13_MODE
#define DIO38_CCMREG PWM13_CCMREG
#define DIO38_CCR PWM13_CCR
#define DIO38_ENOUTPUT PWM13_ENOUTPUT
#define DIO38_AF PWM13_AF
#define DIO38_CLOCK PWM13_CLOCK
#endif
#if (defined(PWM14_CHANNEL) && defined(PWM14_TIMER) && defined(PWM14))
#if (PWM14_TIMER == 1 || (PWM14_TIMER >= 8 & PWM14_TIMER <= 11))
#define PWM14_ENREG RCC->APB2ENR
#define PWM14_APBEN __helper__(RCC_APB2ENR_TIM, PWM14_TIMER, EN)
#define PWM14_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM14_ENREG RCC->APB1ENR
#define PWM14_APBEN __helper__(RCC_APB1ENR_TIM, PWM14_TIMER, EN)
#define PWM14_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM14_TIMREG (__tim__(PWM14_TIMER))
#ifndef PWM14_FREQ
#define PWM14_FREQ 1000
#endif
#if (PWM14_CHANNEL & 0x01)
#define PWM14_MODE 0x0064
#else
#define PWM14_MODE 0x6400
#endif
#if (PWM14_CHANNEL > 2)
#define PWM14_CCMREG CCMR2
#else
#define PWM14_CCMREG CCMR1
#endif
#if (PWM14_TIMER == 1)
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM14_TIMER == 8)
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM14_TIMER >= 1) && (PWM14_TIMER <= 2)
#define PWM14_AF 0x01
#elif (PWM14_TIMER >= 3) && (PWM14_TIMER <= 5)
#define PWM14_AF 0x02
#else
#define PWM14_AF 0x03
#endif
#define PWM14_CCR __ccr__(PWM14_CHANNEL)
#define DIO39_TIMER PWM14_TIMER
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_ENREG PWM14_ENREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_TIMREG PWM14_TIMREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_FREQ PWM14_FREQ
#define DIO39_MODE PWM14_MODE
#define DIO39_CCMREG PWM14_CCMREG
#define DIO39_CCR PWM14_CCR
#define DIO39_ENOUTPUT PWM14_ENOUTPUT
#define DIO39_AF PWM14_AF
#define DIO39_CLOCK PWM14_CLOCK
#endif
#if (defined(PWM15_CHANNEL) && defined(PWM15_TIMER) && defined(PWM15))
#if (PWM15_TIMER == 1 || (PWM15_TIMER >= 8 & PWM15_TIMER <= 11))
#define PWM15_ENREG RCC->APB2ENR
#define PWM15_APBEN __helper__(RCC_APB2ENR_TIM, PWM15_TIMER, EN)
#define PWM15_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define PWM15_ENREG RCC->APB1ENR
#define PWM15_APBEN __helper__(RCC_APB1ENR_TIM, PWM15_TIMER, EN)
#define PWM15_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM15_TIMREG (__tim__(PWM15_TIMER))
#ifndef PWM15_FREQ
#define PWM15_FREQ 1000
#endif
#if (PWM15_CHANNEL & 0x01)
#define PWM15_MODE 0x0064
#else
#define PWM15_MODE 0x6400
#endif
#if (PWM15_CHANNEL > 2)
#define PWM15_CCMREG CCMR2
#else
#define PWM15_CCMREG CCMR1
#endif
#if (PWM15_TIMER == 1)
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
    TIM1->BDTR |= (1 << 15);                                                   \
  }
#elif (PWM15_TIMER == 8)
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
    TIM8->BDTR |= (1 << 15);                                                   \
  }
#else
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM15_TIMER >= 1) && (PWM15_TIMER <= 2)
#define PWM15_AF 0x01
#elif (PWM15_TIMER >= 3) && (PWM15_TIMER <= 5)
#define PWM15_AF 0x02
#else
#define PWM15_AF 0x03
#endif
#define PWM15_CCR __ccr__(PWM15_CHANNEL)
#define DIO40_TIMER PWM15_TIMER
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_ENREG PWM15_ENREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_TIMREG PWM15_TIMREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_FREQ PWM15_FREQ
#define DIO40_MODE PWM15_MODE
#define DIO40_CCMREG PWM15_CCMREG
#define DIO40_CCR PWM15_CCR
#define DIO40_ENOUTPUT PWM15_ENOUTPUT
#define DIO40_AF PWM15_AF
#define DIO40_CLOCK PWM15_CLOCK
#endif

/**********************************************
 *	Analog pins
 **********************************************/
#ifdef ANALOG0
#ifndef ANALOG0_CHANNEL
#define ANALOG0_CHANNEL -1
#endif
#define DIO114_CHANNEL ANALOG0_CHANNEL
#endif
#ifdef ANALOG1
#ifndef ANALOG1_CHANNEL
#define ANALOG1_CHANNEL -1
#endif
#define DIO115_CHANNEL ANALOG1_CHANNEL
#endif
#ifdef ANALOG2
#ifndef ANALOG2_CHANNEL
#define ANALOG2_CHANNEL -1
#endif
#define DIO116_CHANNEL ANALOG2_CHANNEL
#endif
#ifdef ANALOG3
#ifndef ANALOG3_CHANNEL
#define ANALOG3_CHANNEL -1
#endif
#define DIO117_CHANNEL ANALOG3_CHANNEL
#endif
#ifdef ANALOG4
#ifndef ANALOG4_CHANNEL
#define ANALOG4_CHANNEL -1
#endif
#define DIO118_CHANNEL ANALOG4_CHANNEL
#endif
#ifdef ANALOG5
#ifndef ANALOG5_CHANNEL
#define ANALOG5_CHANNEL -1
#endif
#define DIO119_CHANNEL ANALOG5_CHANNEL
#endif
#ifdef ANALOG6
#ifndef ANALOG6_CHANNEL
#define ANALOG6_CHANNEL -1
#endif
#define DIO120_CHANNEL ANALOG6_CHANNEL
#endif
#ifdef ANALOG7
#ifndef ANALOG7_CHANNEL
#define ANALOG7_CHANNEL -1
#endif
#define DIO121_CHANNEL ANALOG7_CHANNEL
#endif
#ifdef ANALOG8
#ifndef ANALOG8_CHANNEL
#define ANALOG8_CHANNEL -1
#endif
#define DIO122_CHANNEL ANALOG8_CHANNEL
#endif
#ifdef ANALOG9
#ifndef ANALOG9_CHANNEL
#define ANALOG9_CHANNEL -1
#endif
#define DIO123_CHANNEL ANALOG9_CHANNEL
#endif
#ifdef ANALOG10
#ifndef ANALOG10_CHANNEL
#define ANALOG10_CHANNEL -1
#endif
#define DIO124_CHANNEL ANALOG10_CHANNEL
#endif
#ifdef ANALOG11
#ifndef ANALOG11_CHANNEL
#define ANALOG11_CHANNEL -1
#endif
#define DIO125_CHANNEL ANALOG11_CHANNEL
#endif
#ifdef ANALOG12
#ifndef ANALOG12_CHANNEL
#define ANALOG12_CHANNEL -1
#endif
#define DIO126_CHANNEL ANALOG12_CHANNEL
#endif
#ifdef ANALOG13
#ifndef ANALOG13_CHANNEL
#define ANALOG13_CHANNEL -1
#endif
#define DIO127_CHANNEL ANALOG13_CHANNEL
#endif
#ifdef ANALOG14
#ifndef ANALOG14_CHANNEL
#define ANALOG14_CHANNEL -1
#endif
#define DIO128_CHANNEL ANALOG14_CHANNEL
#endif
#ifdef ANALOG15
#ifndef ANALOG15_CHANNEL
#define ANALOG15_CHANNEL -1
#endif
#define DIO129_CHANNEL ANALOG15_CHANNEL
#endif

// COM registers
#ifdef MCU_HAS_UART
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#if (UART_PORT < 4 || UART_PORT == 6)
#define COM_UART __usart__(UART_PORT)
#define COM_IRQ __helper__(USART, UART_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(USART, UART_PORT, _IRQHandler)
#define COM_OUTREG (COM_UART)->DR
#define COM_INREG (COM_UART)->DR
#if (UART_PORT == 1 || UART_PORT == 6)
#define COM_APB APB2ENR
#define COM_APBEN __helper__(RCC_APB2ENR_USART, UART_PORT, EN)
#else
#define COM_APB APB1ENR
#define COM_APBEN __helper__(RCC_APB1ENR_USART, UART_PORT, EN)
#endif
#else
#define COM_UART __uart__(UART_PORT)
#define COM_IRQ __helper__(UART, UART_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(UART, UART_PORT, _IRQHandler)
#define COM_APB APB1ENR
#define COM_APBEN __helper__(RCC_APB1ENR_, COM_UART, EN)
#define COM_OUTREG (COM_UART)->DR
#define COM_INREG (COM_UART)->DR
#endif

// remmaping and pin checking
//  USART	TX	RX	APB	APB2ENR	REMAP
//  1	A9	A10	APB2ENR	RCC_APB2ENR_USART1EN	0
//  1	B6	B7	APB2ENR	RCC_APB2ENR_USART1EN	1
//  2	A2	A3	APB1ENR	RCC_APB1ENR_USART2EN	0
//  2	D5	D6	APB1ENR	RCC_APB1ENR_USART2EN	1
//  3	B10	B11	APB1ENR	RCC_APB1ENR_USART3EN	0
//  3	C10	C11	APB1ENR	RCC_APB1ENR_USART3EN	1
//  3	D8	D9	APB1ENR	RCC_APB1ENR_USART3EN	3
//  4	C10	C11	APB1ENR	RCC_APB1ENR_UART4EN	x
//  5	C12	D2	APB1ENR	RCC_APB1ENR_UART5EN	x
#if ((UART_PORT == 1) || (UART_PORT == 6))
#define UART_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define UART_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#if ((UART_PORT >= 1) && (UART_PORT <= 3))
#define GPIO_AF_USART 0x07
#else
#define GPIO_AF_USART 0x08
#endif
#endif

#ifdef MCU_HAS_UART2
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#if (UART2_PORT < 4 || UART2_PORT == 6)
#define COM2_UART __usart__(UART2_PORT)
#define COM2_IRQ __helper__(USART, UART2_PORT, _IRQn)
#define MCU_SERIAL2_ISR __helper__(USART, UART2_PORT, _IRQHandler)
#define COM2_OUTREG (COM2_UART)->DR
#define COM2_INREG (COM2_UART)->DR
#if (UART2_PORT == 1 || UART2_PORT == 6)
#define COM2_APB APB2ENR
#define COM2_APBEN __helper__(RCC_APB2ENR_USART, UART2_PORT, EN)
#else
#define COM2_APB APB1ENR
#define COM2_APBEN __helper__(RCC_APB1ENR_USART, UART2_PORT, EN)
#endif
#else
#define COM2_UART __uart__(UART2_PORT)
#define COM2_IRQ __helper__(UART, UART2_PORT, _IRQn)
#define MCU_SERIAL2_ISR __helper__(UART, UART2_PORT, _IRQHandler)
#define COM2_APB APB1ENR
#define COM2_APBEN __helper__(RCC_APB1ENR_, COM2_UART, EN)
#define COM2_OUTREG (COM2_UART)->DR
#define COM2_INREG (COM2_UART)->DR
#endif

// remmaping and pin checking
//  USART	TX	RX	APB	APB2ENR	REMAP
//  1	A9	A10	APB2ENR	RCC_APB2ENR_USART1EN	0
//  1	B6	B7	APB2ENR	RCC_APB2ENR_USART1EN	1
//  2	A2	A3	APB1ENR	RCC_APB1ENR_USART2EN	0
//  2	D5	D6	APB1ENR	RCC_APB1ENR_USART2EN	1
//  3	B10	B11	APB1ENR	RCC_APB1ENR_USART3EN	0
//  3	C10	C11	APB1ENR	RCC_APB1ENR_USART3EN	1
//  3	D8	D9	APB1ENR	RCC_APB1ENR_USART3EN	3
//  4	C10	C11	APB1ENR	RCC_APB1ENR_UART4EN	x
//  5	C12	D2	APB1ENR	RCC_APB1ENR_UART5EN	x
#if ((UART2_PORT == 1) || (UART2_PORT == 6))
#define UART2_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define UART2_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#if ((UART2_PORT >= 1) && (UART2_PORT <= 3))
#define GPIO_AF_USART2 0x07
#else
#define GPIO_AF_USART2 0x08
#endif
#endif

#if (defined(SPI_CLK) && defined(SPI_SDO) && defined(SPI_SDI))
#define SPI_CLK_PIN __iopin__(SPI_CLK_PORT, SPI_CLK_BIT)
#define SPI_SDO_PIN __iopin__(SPI_SDO_PORT, SPI_SDO_BIT)
#define SPI_SDI_PIN __iopin__(SPI_SDI_PORT, SPI_SDI_BIT)
#ifdef SPI_CS
#define SPI_CS_PIN __iopin__(SPI_CS_PORT, SPI_CS_BIT)
#endif
#define MCU_HAS_SPI
#ifndef SPI_PORT
#define SPI_PORT 1
#endif
#ifndef SPI_MODE
#define SPI_MODE 0
#endif
#ifndef SPI_FREQ
#define SPI_FREQ 1000000UL
#endif
// remmaping and pin checking
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_A1)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_B12)
#define SPI_CLK_AFIO 7
#endif
#if (SPI_PORT == 1) && (SPI_CS_PIN == STM32IO_A4)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CLK_PIN == STM32IO_A5)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDI_PIN == STM32IO_A6)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDO_PIN == STM32IO_A7)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CS_PIN == STM32IO_A15)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CLK_PIN == STM32IO_B3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDI_PIN == STM32IO_B4)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDO_PIN == STM32IO_B5)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_B9)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_B10)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_B12)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_B13)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDI_PIN == STM32IO_B14)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_B15)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDI_PIN == STM32IO_C2)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_C3)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_C7)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_D3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_D6)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_E3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_E5)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_E6)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_E7)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_E11)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_E12)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_E13)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_E14)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CS_PIN == STM32IO_A4)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_A10)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_A11)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_A12)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_CS_PIN == STM32IO_A15)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_B0)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CD_PIN == STM32IO_B1)
#define SPI_CD_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_B3)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDI_PIN == STM32IO_B4)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_B5)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_B8)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_B12)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_B13)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_C10)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDI_PIN == STM32IO_C11)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_C12)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_E3)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CS_PIN == STM32IO_E5)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_E6)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_E7)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CS_PIN == STM32IO_E11)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_E12)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_E13)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_E14)
#define SPI_SDO_AFIO 6
#endif

#ifndef SPI_CLK_AFIO
#error "SPI pin configuration not supported"
#endif
#ifndef SPI_SDO_AFIO
#error "SPI pin configuration not supported"
#endif
#ifndef SPI_SDI_AFIO
#error "SPI pin configuration not supported"
#endif
// #ifdef SPI_CS
// #ifndef SPI_CS_AFIO
// #error "SPI pin configuration not supported"
// #endif
// #endif

#define SPI_REG __helper__(SPI, SPI_PORT, )
#if (SPI_PORT == 2 || SPI_PORT == 3)
#define SPI_ENREG RCC->APB1ENR
#define SPI_ENVAL __helper__(RCC_APB1ENR_SPI, SPI_PORT, EN)
#define SPI_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define SPI_ENREG RCC->APB2ENR
#define SPI_ENVAL __helper__(RCC_APB2ENR_SPI, SPI_PORT, EN)
#define SPI_CLOCK HAL_RCC_GetPCLK2Freq()
#endif

#define SPI_IRQ __helper__(SPI, SPI_PORT, _IRQn)
#define SPI_ISR __helper__(SPI, SPI_PORT, _IRQHandler)

#if (SPI_PORT == 1)
#define SPI_DMA_CONTROLLER_NUM 2
#define SPI_DMA_TX_STREAM_NUM 3
#define SPI_DMA_RX_STREAM_NUM 2
#define SPI_DMA_TX_CHANNEL 3
#define SPI_DMA_RX_CHANNEL 3
#define SPI_DMA_TX_IFR_POS 22
#define SPI_DMA_RX_IFR_POS 16
#elif (SPI_PORT == 2)
#define SPI_DMA_CONTROLLER_NUM 1
#define SPI_DMA_TX_STREAM_NUM 4
#define SPI_DMA_RX_STREAM_NUM 3
#define SPI_DMA_TX_CHANNEL 0
#define SPI_DMA_RX_CHANNEL 0
#define SPI_DMA_TX_IFR_POS 0
#define SPI_DMA_RX_IFR_POS 22
#elif (SPI_PORT == 3)
#define SPI_DMA_CONTROLLER_NUM 1
#define SPI_DMA_TX_CHANNEL 0
#define SPI_DMA_RX_CHANNEL 0
#define SPI_DMA_TX_STREAM_NUM 5
#define SPI_DMA_RX_STREAM_NUM 2
#define SPI_DMA_TX_IFR_POS 6
#define SPI_DMA_RX_IFR_POS 16
#elif (SPI_PORT == 4)
#define SPI_DMA_CONTROLLER_NUM 2
#define SPI_DMA_TX_CHANNEL 5
#define SPI_DMA_RX_CHANNEL 5
#define SPI_DMA_TX_STREAM_NUM 4
#define SPI_DMA_RX_STREAM_NUM 3
#define SPI_DMA_TX_IFR_POS 0
#define SPI_DMA_RX_IFR_POS 22
#elif (SPI_PORT == 5)
#define SPI_DMA_CONTROLLER_NUM 2
#define SPI_DMA_TX_CHANNEL 7
#define SPI_DMA_RX_CHANNEL 7
#define SPI_DMA_TX_STREAM_NUM 6
#define SPI_DMA_RX_STREAM_NUM 5
#define SPI_DMA_TX_IFR_POS 16
#define SPI_DMA_RX_IFR_POS 6
#else
#error "Invalid SPI port"
#endif

