Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcumap_stm32f4x.h
#define SPI_DMA_CONTROLLER __helper__(DMA, SPI_DMA_CONTROLLER_NUM, )
#define SPI_DMA_EN __helper__(RCC_AHB1ENR_DMA, SPI_DMA_CONTROLLER_NUM, EN)

#define SPI_DMA_TX_STREAM                                                      \
  __helper__(__helper__(DMA, SPI_DMA_CONTROLLER_NUM, _Stream),                 \
             SPI_DMA_TX_STREAM_NUM, )
#if (SPI_DMA_TX_STREAM_NUM <= 3)
#define SPI_DMA_TX_IFCR SPI_DMA_CONTROLLER->LIFCR
#define SPI_DMA_TX_ISR SPI_DMA_CONTROLLER->LISR
#else
#define SPI_DMA_TX_IFCR SPI_DMA_CONTROLLER->HIFCR
#define SPI_DMA_TX_ISR SPI_DMA_CONTROLLER->HISR
#endif

#define SPI_DMA_RX_STREAM                                                      \
  __helper__(__helper__(DMA, SPI_DMA_CONTROLLER_NUM, _Stream),                 \
             SPI_DMA_RX_STREAM_NUM, )
#if (SPI_DMA_RX_STREAM_NUM <= 3)
#define SPI_DMA_RX_IFCR SPI_DMA_CONTROLLER->LIFCR
#define SPI_DMA_RX_ISR SPI_DMA_CONTROLLER->LISR
#else
#define SPI_DMA_RX_IFCR SPI_DMA_CONTROLLER->HIFCR
#define SPI_DMA_RX_ISR SPI_DMA_CONTROLLER->HISR
#endif

#define SPI_DMA_TX_IFCR_MASK (0b111101 << SPI_DMA_TX_IFR_POS)
#define SPI_DMA_RX_IFCR_MASK (0b111101 << SPI_DMA_RX_IFR_POS)

#endif

#if (defined(SPI2_CLK) && defined(SPI2_SDO) && defined(SPI2_SDI))
#define SPI2_CLK_PIN __iopin__(SPI2_CLK_PORT, SPI2_CLK_BIT)
#define SPI2_SDO_PIN __iopin__(SPI2_SDO_PORT, SPI2_SDO_BIT)
#define SPI2_SDI_PIN __iopin__(SPI2_SDI_PORT, SPI2_SDI_BIT)
#ifdef SPI2_CS
#define SPI2_CS_PIN __iopin__(SPI2_CS_PORT, SPI2_CS_BIT)
#endif
#define MCU_HAS_SPI2
#ifndef SPI2_PORT
#define SPI2_PORT 1
#endif
#ifndef SPI2_MODE
#define SPI2_MODE 0
#endif
#ifndef SPI2_FREQ
#define SPI2_FREQ 1000000UL
#endif
// remmaping and pin checking
#if (SPI2_PORT == 4) && (SPI2_SDO_PIN == STM32IO_A1)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 3) && (SPI2_CLK_PIN == STM32IO_B12)
#define SPI2_CLK_AFIO 7
#endif
#if (SPI2_PORT == 1) && (SPI2_CS_PIN == STM32IO_A4)
#define SPI2_CS_AFIO 5
#endif
#if (SPI2_PORT == 1) && (SPI2_CLK_PIN == STM32IO_A5)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 1) && (SPI2_SDI_PIN == STM32IO_A6)
#define SPI2_SDI_AFIO 5
#endif
#if (SPI2_PORT == 1) && (SPI2_SDO_PIN == STM32IO_A7)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 1) && (SPI2_CS_PIN == STM32IO_A15)
#define SPI2_CS_AFIO 5
#endif
#if (SPI2_PORT == 1) && (SPI2_CLK_PIN == STM32IO_B3)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 1) && (SPI2_SDI_PIN == STM32IO_B4)
#define SPI2_SDI_AFIO 5
#endif
#if (SPI2_PORT == 1) && (SPI2_SDO_PIN == STM32IO_B5)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_CS_PIN == STM32IO_B9)
#define SPI2_CS_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_CLK_PIN == STM32IO_B10)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_CS_PIN == STM32IO_B12)
#define SPI2_CS_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_CLK_PIN == STM32IO_B13)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_SDI_PIN == STM32IO_B14)
#define SPI2_SDI_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_SDO_PIN == STM32IO_B15)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_SDI_PIN == STM32IO_C2)
#define SPI2_SDI_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_SDO_PIN == STM32IO_C3)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_CLK_PIN == STM32IO_C7)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 2) && (SPI2_CLK_PIN == STM32IO_D3)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 3) && (SPI2_SDO_PIN == STM32IO_D6)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_CLK_PIN == STM32IO_E3)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_CS_PIN == STM32IO_E5)
#define SPI2_CS_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_SDI_PIN == STM32IO_E6)
#define SPI2_SDI_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_SDO_PIN == STM32IO_E7)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_CS_PIN == STM32IO_E11)
#define SPI2_CS_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_CLK_PIN == STM32IO_E12)
#define SPI2_CLK_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_SDI_PIN == STM32IO_E13)
#define SPI2_SDI_AFIO 5
#endif
#if (SPI2_PORT == 4) && (SPI2_SDO_PIN == STM32IO_E14)
#define SPI2_SDO_AFIO 5
#endif
#if (SPI2_PORT == 3) && (SPI2_CS_PIN == STM32IO_A4)
#define SPI2_CS_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_SDO_PIN == STM32IO_A10)
#define SPI2_SDO_AFIO 6
#endif
#if (SPI2_PORT == 4) && (SPI2_SDI_PIN == STM32IO_A11)
#define SPI2_SDI_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_SDI_PIN == STM32IO_A12)
#define SPI2_SDI_AFIO 6
#endif
#if (SPI2_PORT == 3) && (SPI2_CS_PIN == STM32IO_A15)
#define SPI2_CS_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_CLK_PIN == STM32IO_B0)
#define SPI2_CLK_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_CD_PIN == STM32IO_B1)
#define SPI2_CD_AFIO 6
#endif
#if (SPI2_PORT == 3) && (SPI2_CLK_PIN == STM32IO_B3)
#define SPI2_CLK_AFIO 6
#endif
#if (SPI2_PORT == 3) && (SPI2_SDI_PIN == STM32IO_B4)
#define SPI2_SDI_AFIO 6
#endif
#if (SPI2_PORT == 3) && (SPI2_SDO_PIN == STM32IO_B5)
#define SPI2_SDO_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_SDO_PIN == STM32IO_B8)
#define SPI2_SDO_AFIO 6
#endif
#if (SPI2_PORT == 4) && (SPI2_CS_PIN == STM32IO_B12)
#define SPI2_CS_AFIO 6
#endif
#if (SPI2_PORT == 4) && (SPI2_CLK_PIN == STM32IO_B13)
#define SPI2_CLK_AFIO 6
#endif
#if (SPI2_PORT == 3) && (SPI2_CLK_PIN == STM32IO_C10)
#define SPI2_CLK_AFIO 6
#endif
#if (SPI2_PORT == 3) && (SPI2_SDI_PIN == STM32IO_C11)
#define SPI2_SDI_AFIO 6
#endif
#if (SPI2_PORT == 3) && (SPI2_SDO_PIN == STM32IO_C12)
#define SPI2_SDO_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_CLK_PIN == STM32IO_E3)
#define SPI2_CLK_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_CS_PIN == STM32IO_E5)
#define SPI2_CS_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_SDI_PIN == STM32IO_E6)
#define SPI2_SDI_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_SDO_PIN == STM32IO_E7)
#define SPI2_SDO_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_CS_PIN == STM32IO_E11)
#define SPI2_CS_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_CLK_PIN == STM32IO_E12)
#define SPI2_CLK_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_SDI_PIN == STM32IO_E13)
#define SPI2_SDI_AFIO 6
#endif
#if (SPI2_PORT == 5) && (SPI2_SDO_PIN == STM32IO_E14)
#define SPI2_SDO_AFIO 6
#endif

