Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f4x/mcumap_stm32f4x.h
#ifndef SPI2_CLK_AFIO
#error "SPI2 pin configuration not supported"
#endif
#ifndef SPI2_SDO_AFIO
#error "SPI2 pin configuration not supported"
#endif
#ifndef SPI2_SDI_AFIO
#error "SPI2 pin configuration not supported"
#endif
// #ifdef SPI2_CS
// #ifndef SPI2_CS_AFIO
// #error "SPI2 pin configuration not supported"
// #endif
// #endif

#define SPI2_REG __helper__(SPI, SPI2_PORT, )
#if (SPI2_PORT == 2 || SPI2_PORT == 3)
#define SPI2_ENREG RCC->APB1ENR
#define SPI2_ENVAL __helper__(RCC_APB1ENR_SPI, SPI2_PORT, EN)
#define SPI2_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define SPI2_ENREG RCC->APB2ENR
#define SPI2_ENVAL __helper__(RCC_APB2ENR_SPI, SPI2_PORT, EN)
#define SPI2_CLOCK HAL_RCC_GetPCLK2Freq()
#endif

#define SPI2_IRQ __helper__(SPI, SPI2_PORT, _IRQn)
#define SPI2_ISR __helper__(SPI, SPI2_PORT, _IRQHandler)

#if (SPI2_PORT == 1)
#define SPI2_DMA_CONTROLLER_NUM 2
#define SPI2_DMA_TX_STREAM_NUM 3
#define SPI2_DMA_RX_STREAM_NUM 2
#define SPI2_DMA_TX_CHANNEL 3
#define SPI2_DMA_RX_CHANNEL 3
#define SPI2_DMA_TX_IFR_POS 22
#define SPI2_DMA_RX_IFR_POS 16
#elif (SPI2_PORT == 2)
#define SPI2_DMA_CONTROLLER_NUM 1
#define SPI2_DMA_TX_STREAM_NUM 4
#define SPI2_DMA_RX_STREAM_NUM 3
#define SPI2_DMA_TX_CHANNEL 0
#define SPI2_DMA_RX_CHANNEL 0
#define SPI2_DMA_TX_IFR_POS 0
#define SPI2_DMA_RX_IFR_POS 22
#elif (SPI2_PORT == 3)
#define SPI2_DMA_CONTROLLER_NUM 1
#define SPI2_DMA_TX_CHANNEL 0
#define SPI2_DMA_RX_CHANNEL 0
#define SPI2_DMA_TX_STREAM_NUM 5
#define SPI2_DMA_RX_STREAM_NUM 2
#define SPI2_DMA_TX_IFR_POS 6
#define SPI2_DMA_RX_IFR_POS 16
#elif (SPI2_PORT == 4)
#define SPI2_DMA_CONTROLLER_NUM 2
#define SPI2_DMA_TX_CHANNEL 5
#define SPI2_DMA_RX_CHANNEL 5
#define SPI2_DMA_TX_STREAM_NUM 4
#define SPI2_DMA_RX_STREAM_NUM 3
#define SPI2_DMA_TX_IFR_POS 0
#define SPI2_DMA_RX_IFR_POS 22
#elif (SPI2_PORT == 5)
#define SPI2_DMA_CONTROLLER_NUM 2
#define SPI2_DMA_TX_CHANNEL 7
#define SPI2_DMA_RX_CHANNEL 7
#define SPI2_DMA_TX_STREAM_NUM 6
#define SPI2_DMA_RX_STREAM_NUM 5
#define SPI2_DMA_TX_IFR_POS 16
#define SPI2_DMA_RX_IFR_POS 6
#else
#error "Invalid SPI2 port"
#endif

#define SPI2_DMA_CONTROLLER __helper__(DMA, SPI2_DMA_CONTROLLER_NUM, )
#define SPI2_DMA_EN __helper__(RCC_AHB1ENR_DMA, SPI2_DMA_CONTROLLER_NUM, EN)

#define SPI2_DMA_TX_STREAM                                                     \
  __helper__(__helper__(DMA, SPI2_DMA_CONTROLLER_NUM, _Stream),                \
             SPI2_DMA_TX_STREAM_NUM, )
#if (SPI2_DMA_TX_STREAM_NUM <= 3)
#define SPI2_DMA_TX_IFCR SPI2_DMA_CONTROLLER->LIFCR
#define SPI2_DMA_TX_ISR SPI2_DMA_CONTROLLER->LISR
#else
#define SPI2_DMA_TX_IFCR SPI2_DMA_CONTROLLER->HIFCR
#define SPI2_DMA_TX_ISR SPI2_DMA_CONTROLLER->HISR
#endif

#define SPI2_DMA_RX_STREAM                                                     \
  __helper__(__helper__(DMA, SPI2_DMA_CONTROLLER_NUM, _Stream),                \
             SPI2_DMA_RX_STREAM_NUM, )
#if (SPI2_DMA_RX_STREAM_NUM <= 3)
#define SPI2_DMA_RX_IFCR SPI2_DMA_CONTROLLER->LIFCR
#define SPI2_DMA_RX_ISR SPI2_DMA_CONTROLLER->LISR
#else
#define SPI2_DMA_RX_IFCR SPI2_DMA_CONTROLLER->HIFCR
#define SPI2_DMA_RX_ISR SPI2_DMA_CONTROLLER->HISR
#endif

#define SPI2_DMA_TX_IFCR_MASK (0b111101 << SPI2_DMA_TX_IFR_POS)
#define SPI2_DMA_RX_IFCR_MASK (0b111101 << SPI2_DMA_RX_IFR_POS)

#endif

// I2C
#if (defined(I2C_CLK) && defined(I2C_DATA))
#define MCU_HAS_I2C
#define MCU_SUPPORTS_I2C_SLAVE
#ifndef I2C_ADDRESS
#define I2C_ADDRESS 0
#endif

#ifndef I2C_PORT
#define I2C_PORT 1
#endif

#define I2C_APBEN __helper__(RCC_APB1ENR_I2C, I2C_PORT, EN)
#define I2C_REG __helper__(I2C, I2C_PORT, )
#define I2C_SPEEDRANGE (HAL_RCC_GetPCLK1Freq() / 1000000UL)
#define I2C_AFIO 4

#define I2C_IRQ __helper__(I2C, I2C_PORT, _EV_IRQn)
#define I2C_ISR __helper__(I2C, I2C_PORT, _EV_IRQHandler)

#ifndef I2C_FREQ
#define I2C_FREQ 400000UL
#endif
#endif

// Timer registers
#ifndef ITP_TIMER
#define ITP_TIMER 2
#endif
#if (ITP_TIMER == 6)
#define MCU_ITP_ISR TIM6_DAC_IRQHandler
#define MCU_ITP_IRQ TIM6_DAC_IRQn
#elif (ITP_TIMER == 9)
#define MCU_ITP_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_ITP_IRQ TIM1_BRK_TIM9_IRQn
#elif (ITP_TIMER == 10 || ITP_TIMER == 1)
#define MCU_ITP_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_ITP_IRQ TIM1_UP_TIM10_IRQn
#elif (ITP_TIMER == 11)
#define MCU_ITP_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_ITP_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (ITP_TIMER == 12)
#define MCU_ITP_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_ITP_IRQ TIM8_BRK_TIM12_IRQn
#elif (ITP_TIMER == 13 || ITP_TIMER == 8)
#define MCU_ITP_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_ITP_IRQ TIM8_UP_TIM13_IRQn
#elif (ITP_TIMER == 14)
#define MCU_ITP_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_ITP_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_ITP_ISR __helper__(TIM, ITP_TIMER, _IRQHandler)
#define MCU_ITP_IRQ __helper__(TIM, ITP_TIMER, _IRQn)
#endif
#define TIMER_REG __helper__(TIM, ITP_TIMER, )
#if (ITP_TIMER == 1 || (ITP_TIMER >= 8 & ITP_TIMER <= 11))
#define TIMER_ENREG APB2ENR
#define TIMER_RESETREG APB2RSTR
#define TIMER_APB __helper__(RCC_APB2ENR_TIM, ITP_TIMER, EN)
#define TIMER_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define TIMER_ENREG APB1ENR
#define TIMER_RESETREG APB1RSTR
#define TIMER_APB __helper__(RCC_APB1ENR_TIM, ITP_TIMER, EN)
#define TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#ifndef SERVO_TIMER
#define SERVO_TIMER 3
#endif
#if (SERVO_TIMER == 6)
#define MCU_SERVO_ISR TIM6_DAC_IRQHandler
#define MCU_SERVO_IRQ TIM6_DAC_IRQn
#elif (SERVO_TIMER == 9)
#define MCU_SERVO_ISR TIM1_BRK_TIM9_IRQHandler
#define MCU_SERVO_IRQ TIM1_BRK_TIM9_IRQn
#elif (SERVO_TIMER == 10 || SERVO_TIMER == 1)
#define MCU_SERVO_ISR TIM1_UP_TIM10_IRQHandler
#define MCU_SERVO_IRQ TIM1_UP_TIM10_IRQn
#elif (SERVO_TIMER == 11)
#define MCU_SERVO_ISR TIM1_TRG_COM_TIM11_IRQHandler
#define MCU_SERVO_IRQ TIM1_TRG_COM_TIM11_IRQn
#elif (SERVO_TIMER == 12)
#define MCU_SERVO_ISR TIM8_BRK_TIM12_IRQHandler
#define MCU_SERVO_IRQ TIM8_BRK_TIM12_IRQn
#elif (SERVO_TIMER == 13 || SERVO_TIMER == 8)
#define MCU_SERVO_ISR TIM8_UP_TIM13_IRQHandler
#define MCU_SERVO_IRQ TIM8_UP_TIM13_IRQn
#elif (SERVO_TIMER == 14)
#define MCU_SERVO_ISR TIM8_TRG_COM_TIM14_IRQHandler
#define MCU_SERVO_IRQ TIM8_TRG_COM_TIM14_IRQn
#else
#define MCU_SERVO_ISR __helper__(TIM, SERVO_TIMER, _IRQHandler)
#define MCU_SERVO_IRQ __helper__(TIM, SERVO_TIMER, _IRQn)
#endif
#define SERVO_TIMER_REG __helper__(TIM, SERVO_TIMER, )
#if (SERVO_TIMER == 1 || (SERVO_TIMER >= 8 & SERVO_TIMER <= 11))
#define SERVO_TIMER_ENREG APB2ENR
#define SERVO_TIMER_RESETREG APB2RSTR
#define SERVO_TIMER_APB __helper__(RCC_APB2ENR_TIM, SERVO_TIMER, EN)
#define SERVO_CLOCK HAL_RCC_GetPCLK2Freq()
#else
#define SERVO_TIMER_ENREG APB1ENR
#define SERVO_TIMER_RESETREG APB1RSTR
#define SERVO_TIMER_APB __helper__(RCC_APB1ENR_TIM, SERVO_TIMER, EN)
#define SERVO_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

